# Task21_1 к уроку №21 (10.03.23)

# Условие:
# Составьте в произвольной форме список полей в таблице Pupil,
# предполагая, что она будет использоваться в системе учета и
# планирования курса «Разработчик на Питоне»

# pupil_id - id студента
# name - имя
# surname - фамилия
# date_of_birth - дата рождения
# age - возраст
# gender - пол
# phone - телефон для связи
# email - электронная почта
# registration_adress - адрес прописки
# residence_adress - адрес проживания
# education - образование
# course_title - название курса
# skill_set - набор навыков
# payment_status - статус оплаты
# discipline - дисциплина
# attendance - посещаемость
# note - примечание